IdeaRS.Connections
DataHelper.ParseToPoint Method
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "M:IdeaRS.Connections.Data.DataHelper.ParseToPoint(System.String,System.Double,System.IFormatProvider)"]
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static Point ParseToPoint(
	string s,
	double scale,
	IFormatProvider provider = null
)
Parameters
s
Type: String
[Missing <param name="s"/> documentation for "M:IdeaRS.Connections.Data.DataHelper.ParseToPoint(System.String,System.Double,System.IFormatProvider)"]
scale
Type: Double
[Missing <param name="scale"/> documentation for "M:IdeaRS.Connections.Data.DataHelper.ParseToPoint(System.String,System.Double,System.IFormatProvider)"]
provider (Optional)
Type: IFormatProvider
[Missing <param name="provider"/> documentation for "M:IdeaRS.Connections.Data.DataHelper.ParseToPoint(System.String,System.Double,System.IFormatProvider)"]
Return Value
Type: Point
[Missing <returns> documentation for "M:IdeaRS.Connections.Data.DataHelper.ParseToPoint(System.String,System.Double,System.IFormatProvider)"]
See Also
Reference
DataHelper Class
IdeaRS.Connections.Data Namespace